In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
from pydataset import data

Attendance Data

Read the data from the attendance table and calculate an attendance percentage for each student. One half day is worth 50% of a full day, and 10 tardies is equal to one absence.

You should end up with something like this:

In [32]:
att = pd.read_csv('untidy-data/attendance.csv')
att

,Unnamed: 0,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T
2,Billy,A,T,A,A,H,T,P,T
3,John,P,T,H,P,P,T,P,P

In [44]:
att.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    32 non-null     object
 1   dates   32 non-null     object
 2   value   32 non-null     float64
dtypes: float64(1), object(2)
memory usage: 896.0+ bytes

In [33]:
att.rename(columns = {'Unnamed: 0' : 'name'}, inplace= True)

In [34]:
att = att.melt(id_vars ='name', var_name='dates')
att.head()

    name       dates value
0  Sally  2018-01-01     P
1   Jane  2018-01-01     A
2  Billy  2018-01-01     A
3   John  2018-01-01     P
4  Sally  2018-01-02     T

In [35]:
att['value'] = att['value'].map({'P':1, 'T': 0.1, 'H':0.5, 'A':0})

In [38]:
att.groupby('name').value.sum()

name
Billy    1.8
Jane     1.5
John     5.7
Sally    2.9
Name: value, dtype: float64

# played with maping features, next few cells are not assignment related

#Playing with applymap

In [135]:
att = pd.read_csv('untidy-data/attendance.csv')
att

,Unnamed: 0,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T
2,Billy,A,T,A,A,H,T,P,T
3,John,P,T,H,P,P,T,P,P

In [136]:
att.rename(columns = {'Unnamed: 0' : 'name'}, inplace= True)

In [137]:
att['2018-01-01'] = att['2018-01-01'].map(lambda x: x.replace('P', '1') if x == 'P' else x.replace('T', '.1'))
  #only does first then stops cuz it thinks its done

In [138]:
att

,name,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,1,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T
2,Billy,A,T,A,A,H,T,P,T
3,John,1,T,H,P,P,T,P,P

In [140]:
att = att.applymap(lambda x: x.replace('P', '1'))
att = att.applymap(lambda x: x.replace('T', '.1'))
att = att.applymap(lambda x: x.replace('H', '.5'))
att = att.applymap(lambda x: x.replace('A', '0'))
#effective, but still objects

In [141]:
att

,name,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,1,.1,.1,.5,1,0,.1,.1
1,Jane,0,1,.1,.1,.1,.1,0,.1
2,Billy,0,.1,0,0,.5,.1,1,.1
3,John,1,.1,.5,1,1,.1,1,1

In [142]:
att.columns

Index(['name', '2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
       '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08'],
      dtype='object')

In [150]:
att[['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
       '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08']]=att[['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
       '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08']].astype('float')

In [155]:
att

,name,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,1.0,0.1,0.1,0.5,1.0,0.0,0.1,0.1
1,Jane,0.0,1.0,0.1,0.1,0.1,0.1,0.0,0.1
2,Billy,0.0,0.1,0.0,0.0,0.5,0.1,1.0,0.1
3,John,1.0,0.1,0.5,1.0,1.0,0.1,1.0,1.0

In [165]:
att.sum(axis = 1)

/var/folders/lh/dkl_j44s5s192k6tt8pqtrdh0000gn/T/ipykernel_19585/3770244568.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  att.sum(axis = 1)

0    2.9
1    1.5
2    1.8
3    5.7
dtype: float64

In [189]:
l = att.groupby('name').sum()

In [190]:
l.sum(axis = 1)

name
Billy    1.8
Jane     1.5
John     5.7
Sally    2.9
dtype: float64

In [9]:
# att.applymap(lambda x: x.replace('T', 0.1) if x == 'T'\
#                       else x.replace('A', 0) if x == 'A'\
#                       else x.replace('P', 1) if x == 'P'\
#                       else x.replace('H', .5) if x == 'H')

# Return To Assignment



Coffee Levels

    Read the coffee_levels table.
    Transform the data so that each carafe is in it's own column.
    Is this the best shape for the data?

In [39]:
coff = pd.read_csv('untidy-data/coffee_levels.csv')

In [42]:
coff.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   hour           30 non-null     int64
 1   coffee_carafe  30 non-null     object
 2   coffee_amount  30 non-null     float64
dtypes: float64(1), int64(1), object(1)
memory usage: 848.0+ bytes

In [43]:
coff.head()

   hour coffee_carafe  coffee_amount
0     8             x       0.816164
1     9             x       0.451018
2    10             x       0.843279
3    11             x       0.335533
4    12             x       0.898291

In [48]:
coff.pivot_table(index = 'hour', columns = 'coffee_carafe', values = 'coffee_amount')\
.reset_index()

coffee_carafe  hour         x         y         z
0                 8  0.816164  0.189297  0.999264
1                 9  0.451018  0.521502  0.915990
2                10  0.843279  0.023163  0.144928
3                11  0.335533  0.235529  0.311495
4                12  0.898291  0.017009  0.771947
5                13  0.310711  0.997464  0.398520
6                14  0.507288  0.058361  0.864464
7                15  0.215043  0.144644  0.436364
8                16  0.183891  0.544676  0.280621
9                17  0.391560  0.594126  0.436677

In [ ]:
#depends what youre gonna use it for. i think its fine.



Cake Recipes

    Read the cake_recipes table. This data set contains cake tastiness scores for combinations of different recipes, oven rack positions, and oven temperatures.
    Tidy the data as necessary.
    Which recipe, on average, is the best? recipe b
    Which oven temperature, on average, produces the best results? 275
    Which combination of recipe, rack position, and temperature gives the best result? recipe b, bottom rack, 300 degrees

In [57]:
cake = pd.read_csv('untidy-data/cake_recipes.csv')

In [58]:
cake

  recipe:position        225        250        275        300
0        a:bottom  61.738655  53.912627  74.414730  98.786784
1           a:top  51.709751  52.009735  68.576858  50.228470
2        b:bottom  57.095320  61.904369  61.196980  99.248541
3           b:top  82.455004  95.224151  98.594881  58.169349
4        c:bottom  96.470207  52.001358  92.893227  65.473084
5           c:top  71.306308  82.795477  92.098049  53.960273
6        d:bottom  52.799753  58.670419  51.747686  56.183110
7           d:top  96.873178  76.101363  59.571620  50.971626

In [63]:
cake['location'] = cake['recipe:position'].str.split(':').str[1]

In [64]:
cake['recipe'] = cake['recipe:position'].str.split(':').str[0]

In [71]:
cake = cake.drop(columns = 'recipe:position')

In [72]:
cake

         225        250        275        300 location recipe
0  61.738655  53.912627  74.414730  98.786784   bottom      a
1  51.709751  52.009735  68.576858  50.228470      top      a
2  57.095320  61.904369  61.196980  99.248541   bottom      b
3  82.455004  95.224151  98.594881  58.169349      top      b
4  96.470207  52.001358  92.893227  65.473084   bottom      c
5  71.306308  82.795477  92.098049  53.960273      top      c
6  52.799753  58.670419  51.747686  56.183110   bottom      d
7  96.873178  76.101363  59.571620  50.971626      top      d

In [78]:
cake.groupby('recipe').mean().sum(axis =1)  # Which recipe, on average, is the best? b

recipe
a    255.688805
b    306.944297
c    303.498991
d    251.459377
dtype: float64

In [79]:
#best oven temp?
cake.groupby('recipe').mean().sum() #275

225    285.224088
250    266.309749
275    299.547015
300    266.510618
dtype: float64

In [95]:
#best combo? b, bottom, 300
cake.max() #300

225         96.873178
250         95.224151
275         98.594881
300         99.248541
location          top
recipe              d
dtype: object

In [104]:
cake[cake['300'] > 99.248] # bottom, b

        225        250       275        300 location recipe
2  57.09532  61.904369  61.19698  99.248541   bottom      b